{
  "backend/main.mo": "Main Motoko actor defining data models (UserProfile, GstCalculation, Invoice, DueDate, LearningContent, TaxTip, CaLead) and CRUD functions with role-based access control using MixinAuthorization and AccessControl modules.",
  "feature_evidence.json": "Feature evidence report mapping four features (TypeScript compilation fixes, React Query validation, actor method call fixes, routing configuration) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend source files describing React components, hooks, utilities, and pages with their TypeScript types, error handling, and integration patterns.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, muted, accent, destructive, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, title 'GST SmartAssist', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with lazy-loaded pages, QueryClientProvider, ThemeProvider, authentication flow via useInternetIdentity, profile setup gating, and loading states.",
  "frontend/src/components/AdBanner.tsx": "Conditional ad banner component displaying upgrade image for Free tier users only, hidden for Premium users, with click navigation to upgrade page.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with five tabs (Home, Calculator, Invoices, Reminders, Learn) using Lucide icons and active state highlighting based on current route.",
  "frontend/src/components/ContextualUpgradePrompt.tsx": "Contextual upgrade prompt component with TypeScript interface and index signature displaying context-specific messages (invoice-limit, premium-content, ca-support) with upgrade button.",
  "frontend/src/components/Layout.tsx": "Main layout component that wraps pages with a sticky header showing app logo and premium badge (if applicable), main content area, and bottom navigation.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component displaying app branding, feature highlights (calculator, invoices, reminders), and Internet Identity login button with loading state.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form for new users to enter name, email, optional business name and GSTIN, creating a free user profile on submission.",
  "frontend/src/components/UpgradeBanner.tsx": "Promotional banner component encouraging free users to upgrade to premium plan for ₹49/month; hidden for premium users.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useLearningProgress.ts": "Hook managing learning topic completion progress per category using localStorage, providing functions to mark topics complete and calculate completion percentages.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, GST calculations, invoices, reminders, learning content, and tips with automatic cache invalidation.",
  "frontend/src/hooks/useUserPlan.ts": "Hook that derives user plan information (premium status, plan type, subscription expiry) from the current user profile query.",
  "frontend/src/index.css": "Tailwind CSS configuration file defining CSS custom properties for light and dark themes, including colors for UI components, charts, and sidebar elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/Calculator.tsx": "GST Calculator page that computes GST amounts based on base amount, GST slab (5/12/18/28%), and inclusive/exclusive mode, with functionality to save and delete calculation history.",
  "frontend/src/pages/CaSupport.tsx": "CA Support page allowing premium users to submit queries to chartered accountants with name, phone, and description fields, and displays a list of submitted queries with status badges (pending/assigned/closed).",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard displaying welcome message, quick action buttons for calculator/invoices/tax-tips/upgrade, upcoming due dates for GST filing and advance tax, plus upgrade and ad banners.",
  "frontend/src/pages/Invoices.tsx": "Invoice generator page for creating invoices with customer details, item info, quantity, price, and GST slab, with free plan limits (3/month) and premium unlimited access, plus invoice viewing and deletion.",
  "frontend/src/pages/Learn.tsx": "Interactive learning module with tabbed categories (GST Basics, Input Tax Credit, Filing) showing progress tracking, topic cards, and quiz functionality to test understanding after completing lessons.",
  "frontend/src/pages/Reminders.tsx": "Displays upcoming due dates and custom reminders with ability to create new reminders. Includes a dialog form for creating custom reminders with title, description, due date, and notification toggle.",
  "frontend/src/pages/TaxTips.tsx": "Shows a list of tax tips with premium content locked behind subscription. Displays tips in cards with click-to-expand dialog and contextual upgrade prompts for non-premium users.",
  "frontend/src/pages/Upgrade.tsx": "Premium subscription page showing feature comparison table and upgrade CTA. Displays current premium status with expiry date or upgrade button linking to Razorpay payment.",
  "frontend/src/utils/gstCalculations.ts": "Utility functions for GST calculations including slab-to-percentage conversions and calculating GST amounts (inclusive/exclusive) with CGST/SGST breakdown.",
  "frontend/src/utils/invoiceLimits.ts": "Checks invoice generation limits for free tier users (3 per month). Provides functions to count current month invoices and determine if limit is reached.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both regular query strings and hash-based routing. Includes sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar colors, animations, and accessibility-focused touch target sizes.",
  "project_state.json": "Project state file for GST SmartAssist, a mobile-first SaaS app for Indian small businesses with GST calculations, invoices, reminders, and learning resources. Defines 7 Glide tables (Users, GST Calculations, Invoices, Due Dates, Learning Section, Tax Tips, CA Leads) with Free/Premium tier logic, computed columns for tax calculations, and features including dashboard, calculator, invoice generator, due date reminders, learning section, and tax tips."
}